#+TITLE: Emacs Configuration
#+AUTHOR: Walker Malling

* Org

Set org-drill directories to look in any file in my org directory.

#+begin_src emacs-lisp
(defun org-drill-all ()
  (interactive)
  (org-drill
  (directory-files-recursively "~/Dropbox/Org/" "\.org$")))

(require 'cl)
(require 'org-drill)
#+end_src

Set TODO sequence:

#+begin_src emacs-lisp
(setf org-todo-keywords
  '((sequence "TODO(t)" "NEXT(n)" "ELECTRIC(e)" "BLOCKED(b)" "LTP(l)" "|" "DONE(d)" "CANCELLED(c)"))
      org-todo-keyword-faces '(("TODO"      . (:foreground "white"))
                               ("NEXT"      . (:foreground "green"))
                               ("BLOCKED"   . (:foreground "red"))
                               ("ELECTRIC"  . (:foreground "blue"    :weight bold :style italic))
                               ("DONE"      . (:foreground "black"  :style ))
                               ("CANCELLED" . (:foreground "black"  :style ))))
#+end_src

Tell org where to look for agenda files.
Set an ispell file.
Configure appearance and clock behavior.

#+BEGIN_SRC emacs-lisp
(setf org-agenda-files '("~/Dropbox/Org/agenda")
      ispell-personal-dictionary "~/Dropbox/Org/dictionary"

      org-startup-indented t
      org-hide-emphasis-markers t
      org-agenda-skip-scheduled-if-deadline-is-shown t
      org-clock-idle-time 10
      org-log-done 'time
      org-clock-persist 'history
      org-list-allow-alphabetical t)
#+end_src

https://orgmode.org/worg/org-tutorials/advanced-searching.html

#+begin_src emacs-lisp
(setq org-agenda-custom-commands
      '(
        ("r" "refile and next"
             ((agenda "")
              (tags "refile"
                    ((org-agenda-overriding-header "Refile")))
              (todo "ELECTRIC"
                    ((org-agenda-overriding-header "ELECTRIC!")))
              (todo "NEXT"
                    ((org-agenda-overriding-header "Next")))
              (tags "-refile/!-NEXT-ELECTRIC"
                    ((org-agenda-overriding-header "Other Todo")))
              (tags "LTP"
                    ((org-agenda-overriding-header "Long Term Project")))
))

        ))
#+end_src

#+RESULTS:
| r | refile and next | ((agenda ) (tags-todo refile) (todo NEXT)) |

